package com.ccservice.b2b2c.atom.servlet.TongChengTrain.test;

import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Date;
import java.util.List;
import java.util.Random;
import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;

import net.sf.json.JSONObject;

import com.ccservice.b2b2c.atom.component.SendPostandGet;
import com.ccservice.b2b2c.atom.service12306.TimeUtil;
import com.ccservice.b2b2c.atom.servlet.TongChengTrain.TongchengSupplyMethod;
import com.ccservice.b2b2c.base.train.Trainorder;
import com.ccservice.b2b2c.base.train.Trainticket;
import com.ccservice.b2b2c.base.trainpassenger.Trainpassenger;
import com.tenpay.util.MD5Util;

/**
 * 同程接口测试类
 * 
 * @time 2014年12月12日 下午2:46:05
 * @author chendong
 */
public class TongchengyibuTest extends TongchengSupplyMethod {
    //    测试parentid  tongcheng_train_test
    //    测试KEY   lmh46c63ubh1h8oj6680wbtgfi40btqh

    //    正式parentid    tongcheng_train
    //    正式key x3z5nj8mnvl14nirtwlvhvuialo0akyt
    public String partnerid = "tongcheng_train";

    public String key = "x3z5nj8mnvl14nirtwlvhvuialo0akyt";

    //    public String partnerid = "tongcheng_train";

    //
    //    public String key = "lmh46c63ubh1h8oj6680wbtgfi40btqh";

    public String callbackurl = "testurl";

    //    public String callbackurl = "test_ceshi";

    /**
     * 查询url
     */
    //        public String trainsearchurl = "http://tcsearchtrain.hangtian123.net/trainSearch";

    /**
     * 订单url
     */
    public String trainorderurl = "http://tctrainorder.hangtian123.net/tcTrain";

    //    public String trainorderurl = "http://211.103.207.135:8080/cn_interface/tcTrain";
    //        public String trainorderurl = "http://211.103.207.135:8080/cn_interface/tcTrain";
    //    public String trainorderurl = "http://121.199.25.199:49016/cn_interface/tcTrain";

    //    public String trainorderurl = "http://localhost:8080/cn_interface/tcTrain";

    public final static SimpleDateFormat yyyyMMddHHmmss = new SimpleDateFormat("yyyyMMddHHmmss");

    public final static SimpleDateFormat yyyyMMddHHmmssSSS = new SimpleDateFormat("yyyyMMddHHmmssSSS");

    public static void main(String[] args) {
        TongchengyibuTest test = new TongchengyibuTest();

        System.out.println(TimeUtil.gettodaydate(4));

        String resultString = "";
        //        String orderid = "";
        //        Trainorder trainorder = new Trainorder();
        //=================4.1. 查询账户余额
        //        resultString = test.query_money();
        //=================4.5. 申请分配座位席别
        //        List<Trainpassenger> passengers = new ArrayList<Trainpassenger>();
        //        passengers.add(test.getTrainpassenger("陈新福", "362322198210167517", 1, "1", 1f, "", 1));
        //        passengers.add(test.getTrainpassenger("王战朝", "410883199006281010", 1, "1", 1f, "", 1));
        //        passengers.add(test.getTrainpassenger("石文兵", "150102196906080018", 1, "1", 1f, "EC509466651010013", 1));
        //        passengers.add(test.getTrainpassenger("唐陌晗", "500382199301313175", 1, "1", 1f, "", 1));
        //        passengers.add(test.getTrainpassenger("陶蕾", "341222198912259192", 1, "1", 1f, "", 1));
        //"zwname":"二等座","price":"1000.03","piaotypename":"儿童票","zwcode":"O","piaotype":"2","passengersename":"陈娅慧","passporttypeseidname":"二代身份证","passportseno":"361128200806017129","passporttypeseid":"1","cxin":"","passengerid":1
        //        passengers.add(test.getTrainpassenger("陈娅慧", "361128200806017129", 1, "1", 1f, "", 2));
        //        orderid = "TC_20150101_" + getcurrentTimeMillis();
        //        String checi = "6801";
        //        String from_station_code = "TYV";
        //        String from_station_name = "太原";
        //        String to_station_code = "TBV";
        //        String to_station_name = "太原北";
        //        String train_date = "2015-06-01";
        //        resultString = test.train_order(orderid, checi, from_station_code, from_station_name, to_station_code,
        //                to_station_name, train_date, passengers);
        //=================4.6. 火车票确认出票
        //        resultString = test.train_confirm("TC_20150127_fiendyibutest_1422543249230_92_76_76_87", "jy"
        //                + getcurrentTimeMillis());
        //        resultString = test.train_confirm("TC_20150127_fiendyibutest_1422543248928_69_63_87_65", "jy"
        //                + getcurrentTimeMillis());
        //=================4.7. 取消火车票订单
        //        resultString = test.train_cancel("TC_20150120_fiendtest_1421763840998_41_56_32_73", getcurrentTimeMillis()
        //                + "t");

        //=================
        //        resultString = test.train_query_status("TC_1418792969124");
        //=================4.9. 查询订单详情
        //        resultString = test.train_query_info("TC_20141227_1419667102204", "");
        //=================

        //=================4.10. 在线退票
        //        passengers.add(test.getTrainpassenger("陶蕾", "341222198912259192", 1, "1", 1f, "EC219240101100002", 1));
        //        trainorder.setPassengers(passengers);
        //        orderid = trainorder.getQunarOrdernumber();
        //        String transactionid = "jy_tp_" + getcurrentTimeMillis();
        //        String ordernumber = trainorder.getExtnumber();
        //        String reqtoken = getcurrentTimeMillis() + "";
        //        String callbackurl = "http://tsflightopenapi.17usoft.com/train/services/hthyRefundAsyncNotify";
        //        resultString = test.return_ticket(orderid, transactionid, ordernumber, reqtoken, callbackurl, trainorder);
        //=================
        //        System.out.println(resultString);

        //TODO  测试开始
        //        =================批量给同程订单！！！！！！！！！！！！！！！！！！！！
        test.testhaoduotongchengdingdan();

        //=================同程批量确认出票
        //        test.tongchengpiliangzhifu(new String[] { "TC_20150107_fiendtest_1421030619978_3_44_5_63",
        //                "TC_20150107_fiendtest_1421030619882_31_39_40_99", "TC_20150107_fiendtest_1421030619790_39_93_54_71",
        //                "TC_20150107_fiendtest_1421030619222_97_67_25_90", });

        //        callbackzhanzuojieguo();
    }

    /**
     * 占座结果回调测试方法
     * 
     * @time 2015年1月6日 下午1:47:40
     * @author chendong
     */
    private static void callbackzhanzuojieguo() {
        String result = "false";
        String url = "http://localhost:9004/cn_interface/tcTrainCallBack";
        JSONObject jso = new JSONObject();
        jso.put("trainorderid", 3595);
        jso.put("method", "train_order_callback");
        jso.put("returnmsg", "");
        try {
            result = SendPostandGet.submitPost(url, jso.toString(), "UTF-8").toString();
        }
        catch (Exception e) {
            e.printStackTrace();
        }
        System.out.println(result);
    }

    /**
     * 同程测试批量下单
     * 
     * @time 2014年12月28日 下午7:34:54
     * @author chendong
     */
    public void testhaoduotongchengdingdan() {
        // 创建一个可重用固定线程数的线程池
        ExecutorService pool = Executors.newFixedThreadPool(100);
        // 创建实现了Runnable接口对象，Thread对象当然也实现了Runnable接口
        Thread t1 = null;
        //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!姓名,证件号,证件类型,座位编码,价格,票号,乘客类型
        //        executepool("周号,340122199203174813,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-05", t1, pool);//身份审核未通过
        //        executepool("张帆,130281198805090045,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-05", t1, pool);
        //        executepool(
        //                "景党会,610424197801080433,1,1,1000f,,1,|叶扬树,511025196210271913,1,1,1000f,,1,|胥中奎,510113197310290410,1,1,1000f,,1,",
        //                "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //
        //        executepool(
        //                "唐福蓉,512923197503181905,1,1,1f,,1|唐福蓉,512923197503181905,1,1,1f,,2|唐福蓉,512923197503181905,1,1,1f,,2",
        //                "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("冯杉杉,330681198610115013,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-28", t1, pool);

        //        executepool("郝兴武,511527198805041833,1,O,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("王保江,654001196803115732,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("李燕,654001197706303349,1,1,1f,,1|宋雪儿,210211200603233168,1,1,1f,,2|"
        //                + "侯玉奎,210922195309201812,1,1,1f,,2|侯玉奎,210922195309201812,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB",
        //                "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool(
        //                "郭世龙,231026198309190310,1,1,1f,,1|李文华,43011119701025161X,1,1,1f,,1|李文华,43011119701025161X,1,1,1f,,2",
        //                "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("王顺利,420222198405132014,1,1,1f,,1|白焕江,654323197704290518,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB",
        //                "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("赵春艳,654323197709140527,1,1,1f,,1|赵燕,522423198511213662,1,1,1f,,1|赵燕,522423198511213662,1,1,1f,,2|"
        //                + "赵燕,522423198511213662,1,1,1f,,2|赵燕,522423198511213662,1,1,1f,,2", "6233", "HBB", "哈尔滨", "VBB",
        //                "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("胡泽轩,511111197311131014,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("孙晓凤,220722198106234424,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("夏琪,620503198809174514,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("杨素娜,620503199204014221,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("高倩,610323199611120948,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("何尧尧,610322199302071138,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-25", t1, pool);
        //        executepool("张凯凯,610322199309190316,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("王柳清,110105197007158340,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("姚素芳,23010419440328002X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-25", t1, pool);
        //        executepool("张秋凡,230104194108200015,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("郑辉权,51222219720101287x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-28", t1, pool);
        //        executepool("张婷,510602198111067980,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-25", t1, pool);
        //        executepool("周顺财,232332195602190310,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-28", t1, pool);
        //        executepool("房明云,232332195809190326,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("郭淼,654001198305100318,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-28", t1, pool);
        //        executepool("陈色非也,622924197908012087,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("杨克建,422423196702010611,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("高伟,421022198312120639,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("张海林,432422195707271619,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("黄min,654001196411304518,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-24", t1, pool);
        //        executepool("黎香明,654001196811032419,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-25", t1, pool);
        //        executepool("谭显龙,421022197005201557,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("卢和xuan,362126196302090014,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("吴庸升,440524197110194531,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("周铭新,32011219530329165X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("张友,513030197411038410,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("王倩,120224198502200527,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("康永新,610502197201240859,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("俞向润,533224197603192145,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("温莉莉,53322419920601220X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("邓玉兰,513621195208011906,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("迪尔木拉提艾沙,654122195901080054,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("德力木拉提依木拉木孜,654122195709270018,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1,
        //                pool);
        //
        //        executepool("胡永生,141125199002180072,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("刘恩和,450328201101022119,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("刘安童,450328200608312137,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李涨,330326197110085710,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("靳欣兰,610521199808102047,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("王晨臣,41272419970226443X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("王旭,222327197009070736,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("姜传俊,370684197005140551,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("曲天江,370622196708060511,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("刘桂峰,452328195302282113,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("吴二金,352622198110120484,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("冯雪丽,412722198506122525,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("殷树斌,230303199103304015,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //                executepool("张佩佩,612501199001093393,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //                executepool("邱茂华,211121195703163616,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("麻树友,220182195512166631,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("杨翠玲,420621199210246361,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("何启玉,420624195806281310,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("何大宝,420624196606132219,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("李治刚,420624196701025534,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("黄会娟,412724197906184424,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("惠乐乐,612728199101222640,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-30", t1, pool);
        //        executepool("张丁,612701198712111443,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("杜曼莉,610422198108234029,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("维特曾灏,650103197602262815,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-30", t1, pool);
        //        executepool("黄桂清,350525199005174030,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("岳双群,132324195502160014,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("尼加提阿布都热西提,650102198611194015,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("唐红,511023198609136648,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("雷光伟,332501198103230211,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-30", t1, pool);
        //        executepool("唐永群,511023197203106663,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-31", t1, pool);
        //        executepool("安芳,632122199607125920,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-01", t1, pool);
        //        executepool("李风勤,412724197307163445,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-02", t1, pool);
        //        executepool("高亮元,412724197011023419,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-03", t1, pool);
        //        executepool("李忠华,653121197705170011,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-17", t1, pool);
        //        executepool("张宏,152101196803132423,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-18", t1, pool);
        //        executepool("孙伟kun,152126198201051817,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-19", t1, pool);
        //        executepool("李志高,110224197901010054,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-20", t1, pool);
        //        executepool("陈春进,421126197809095738,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-22", t1, pool);
        //        executepool("李荣亮,532525196205101719,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("贾志英,622427195202107036,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //                executepool("曹玉珍,622427195712077041,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-18", t1, pool);
        //                executepool("李建平,652601196511074319,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-18", t1, pool);
        //                executepool("阿吉艾科拜尔图尔荪,65312119950104061X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-19", t1, pool);
        //                executepool("汪云智,422722196212151833,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "", t1, pool);
        //                executepool("肖家芹,422722196502101826,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-15", t1, pool);
        //TODO 测试开始
        //        executepool("代进萍,532624199406170529,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-16", t1, pool);
        //        executepool("金名伟,370681198209176818,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("张建成,51112819660703251X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-28", t1, pool);
        //        executepool("任何琼,132924197010115809,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-01", t1, pool);
        //        executepool("任有琼,132924197804205785,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-02", t1, pool);
        //        executepool("白延飞,612730197106180518,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-21", t1, pool);
        //        executepool("花泽艳,45050219870104076X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-04", t1, pool);
        //        executepool("温桂林,622722195403244429,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-05", t1, pool);
        //        executepool("魏德斌,14043019890420723X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("王超,140424199010150411,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-06", t1, pool);
        //        executepool("段元玲,370831196408153625,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-07", t1, pool);
        //        executepool("王芳,371326199003180445,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("蒋艳梅,452330196802102947,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-28", t1, pool);
        //        executepool("李佳烨,654025200509050261,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("陈宏东,452330196312120034,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-30", t1, pool);
        //        executepool("杨小琴,612524197401261902,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-31", t1, pool);
        //        executepool("黄兰云,231025194912211820,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-01", t1, pool);
        //        executepool("钟开初,430123197307068715,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-02", t1, pool);
        //        executepool("吴秀君,65412519750911318X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-03", t1, pool);
        //        executepool("李新海,65412519760917027X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("赵德兴,422130194811131912,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-25", t1, pool);
        //        executepool("卡斯木江阿布力孜,654101198106141972,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("吴贤喜,510624196511023011,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-07", t1, pool);
        //        executepool("叶林,513226197111130019,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-08", t1, pool);
        //        executepool("黄涛,513621197810031271,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-09", t1, pool);
        //        executepool("冯秀霞,130425196704087745,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-10", t1, pool);
        //        executepool("贾占波,51292919750622223X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-11", t1, pool);
        //        executepool("褚飞,370403197906014510,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-12", t1, pool);
        //        executepool("阳知光,432831197906160839,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-13", t1, pool);
        //        executepool("李靓,432502198502098334,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "", t1, pool);
        //        executepool("唐永强,510823197903141032,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-15", t1, pool);
        //        executepool("周先蕊,372901196602231243,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-16", t1, pool);
        //        executepool("刘燕,372901198810291223,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("徐洪珍,520121198804296624,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("黄灿,532101198311050018,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("任永智,642223198202091012,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("潘阳阳,142726199005200366,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("惠进虎,62282719880720095x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("黎桂芬,532227197308121545,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("许翠梅,53032419830910034X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("谢红春,530324198302180375,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("汪金明,34082519830301043X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("吉克石作,513437199207255923,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("蔡治兰,51152919851027582X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-28", t1, pool);
        //        executepool("涂世云,511529198611245611,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("夏禹廷,220183198609216818,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-30", t1, pool);
        //        executepool("沈玉莲,512925196610036306,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-31", t1, pool);
        //        executepool("芦国亮,211325197212150496,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-09", t1, pool);
        //        executepool("饶建华,362524197611057510,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-01", t1, pool);
        //        executepool("饶建华,362524197611057510,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-01", t1, pool);
        //        executepool("胡桂金,362524197611057510,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-02", t1, pool);
        //        executepool("蔡治敏,512535198212015825,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-03", t1, pool);
        //        executepool("罗合军,512535197902175813,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("李武作,220122197403047011,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("殷树斌,230303199103304015,1,1,1f,,1", "K472", "YYQ", "岳阳", "BJP", "北京 ", "2015-06-07", t1, pool);
        //        executepool("林友山,512535197504135412,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-07", t1, pool);
        //        executepool("罗菲,511529200301235821,1,1,1f,,1|魏庆,41022119850711189X,1,1,1f,,2|魏庆,41022119850711189X,1,1,1f,,2",
        //                "6336", "CCT", "长春", "CET", "长春南", "2015-06-08", t1, pool);
        //        executepool("魏庆,41022119850711189X,1,1,1f,,1|赵小燕,530323198806241534,1,1,1f,,2", "6336", "CCT", "长春", "CET",
        //                "长春南", "2015-06-09", t1, pool);
        //        executepool("赵小燕,530323198806241534,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-10", t1, pool);
        //        executepool(
        //                "姜小桂,530324198606060321,1,1,1f,,1|姜小桂,530324198606060321,1,1,1f,,2|姜小桂,530324198606060321,1,1,1f,,2|罗合军,512535197902175813,1,1,1f,,1|罗合军,512535197902175813,1,1,1f,,2",
        //                "6336", "CCT", "长春", "CET", "长春南", "2015-06-11", t1, pool);
        //        executepool("毛云华,532226198011190910,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-22", t1, pool);
        //        executepool("邹绍米,530324197609100945,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "", t1, pool);
        //        executepool("罗合军,512535197902175813,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-04", t1, pool);
        //        executepool("李武作,220122197403047011,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-15", t1, pool);
        //        executepool("徐家先,512535197501115422,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-16", t1, pool);
        //        executepool("林友山,512535197504135410,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-07", t1, pool);
        //        executepool("罗菲,511529200301235821,1,1,1f,,1|魏庆,41022119850711189X,1,1,1f,,2|魏庆,41022119850711189X,1,1,1f,,2",
        //                "6336", "CCT", "长春", "CET", "长春南", "2015-06-08", t1, pool);
        //        executepool("魏庆,41022119850711189X,1,1,1f,,1|赵小燕,530323198806241534,1,1,1f,,2", "6336", "CCT", "长春", "CET",
        //                "长春南", "2015-06-09", t1, pool);
        //        executepool("赵小燕,530323198806241534,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-10", t1, pool);
        //        executepool(
        //                "姜小桂,530324198606060321,1,1,1f,,1|姜小桂,530324198606060321,1,1,1f,,2|姜小桂,530324198606060321,1,1,1f,,2|罗合军,512535197902175813,1,1,1f,,1|罗合军,512535197902175813,1,1,1f,,2",
        //                "6336", "CCT", "长春", "CET", "长春南", "2015-06-11", t1, pool);
        //        executepool("毛云华,532226198011190919,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-13", t1, pool);
        //        executepool("邹绍米,530324197609100945,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-14", t1, pool);
        //        executepool("李新涛,420923197303150019,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-15", t1, pool);
        //        executepool("张斌,431224198311206313,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-16", t1, pool);
        //        executepool("苏亚利,610321198209051828,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("李海明,410221198802063018,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-18", t1, pool);
        //        executepool("涂成,420821199102134013,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-19", t1, pool);
        //        executepool("马书杰,371021197310143532,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-20", t1, pool);
        //        executepool("杜卫朋,61043119870630381X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-21", t1, pool);
        //        executepool("赵一,331003198610031334,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-22", t1, pool);
        //        executepool("高丹,430726199101031328,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("韩浩,420921198110144677,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-24", t1, pool);
        //        executepool("夏璇,513428199706150628,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("赵昌玉,513428197601090623,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("吴彩风,422322196512256125,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("董强,511321199606057379,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-28", t1, pool);
        //
        //        executepool("汪美霞,420527199605065365,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("董强,511321199606057379,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-27", t1, pool);
        //        executepool("闫丹,612725199210131028,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("郝兴全,511527199004061812,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("马莲花,510524198812134982,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("王焕新,432524194605077413,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("王伟,13092919810926223X,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-25", t1, pool);
        //        executepool("王曼,232301199805035728,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("王云,410526197909208225,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-27", t1, pool);
        //        executepool("高庆杰,410526197901228475,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-28", t1, pool);
        //        executepool("肖爱兰,362122197111062546,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("廖红,362122196809127490,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-30", t1, pool);
        //        executepool("陆钦毫,522727199506250318,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-31", t1, pool);
        //        executepool("韩军伟,412728198211065250,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-01", t1, pool);
        //        executepool("王华果,652624196303270520,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-02", t1, pool);
        //        executepool("关新任,652624196203070513,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-03", t1, pool);
        //        executepool("曹沅英,362123196611280023,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("于婷婷,110105199008134120,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-25", t1, pool);
        //        executepool("于保兰,110105196308264142,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("雷旭辉,622727199205033217,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-07", t1, pool);
        //        executepool("杜俊,429005198702213057,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-08", t1, pool);
        //        executepool("郭娜,120108198711170541,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-09", t1, pool);
        //
        //        executepool("王明静,342601198905136822,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("周号,340122199203174813,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("黄满辉,440183199104213713,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("陈仕满,441781199007011475,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("杜显超,510222196402104926,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("曾庆全,210381198401124515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-21", t1, pool);
        //        executepool("曾庆全,210381198401124515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-21", t1, pool);
        //        executepool("曾庆全,210381198401124515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("曾庆全,210381198401124515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //
        //        //TODO 01202235测试
        executepool("刘建智,230303199103304015,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("畅柏,610522198501242012,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("艾国营,411081196703136856,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张金叶,411081196707026865,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄菊芬,452330197508240809,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("孙小东,640321199101121118,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("董凤连,130984196912084829,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈建刚,530324197909030555,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李东琼,530324197807130520,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄兴海,411502198410190518,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("高换英,53222619660522032X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李文通,53032419890805033X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李欣,530325199506082161,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李坤,530325198706201394,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("米娥,530324198802150922,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("白艳美,530427198307030928,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("白仙,532428196203041066,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张国锋,411481199103098433,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("米娥,530324198802150922,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李坤,530325198706201394,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("芦国亮,211325197212150496,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("安凤云,220523196409093063,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("朱堂臣,23262319780920319X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨卫华,350430198912243512,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李晓佳,642124197910012369,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李志国,130221197106134116,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王秀兰,622625197903130121,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("袁董帅,622627197412034613,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张胜伟,130525198706182310,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张胜伟,130525198706182310,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘艳丽,412722198305085721,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("赵江山,412722198108245730,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("毛泽云,530325198403081399,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李米金,530325198811091326,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("侯慧,44023219870201204X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("娄艳胜,411122197309162458,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("凌建香,432522197512147428,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("侯慧,44023219870201204X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("程福根,362334197802154614,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("鲍时花,362334197802262842,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("凌建香,432522197512147428,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("方义庭,420601196311120750,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("林振超,350524198912073515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘少云,510602196904285778,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("方义庭,420601196311120750,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李世彬,512530197601056317,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("万生文,512530197612016329,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张小琴,510229197509285228,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("吕秀芹,362334198611216848,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("俞春焰,362334198202172813,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("鲍欣宜,362334196310162824,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("鲍细淦,362334195601052815,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("金天法,36233419711210461X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("毛泽云,530325198403081399,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李米金,530325198811091326,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖琴,500222199008275825,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("邓先红,500222198611265459,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖艺清,350524198709200515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("何海洋,350583198706191035,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄春芳,341223197204174368,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("姜彪,341223199501174451,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("何海洋,350583198706191035,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖艺清,350524198709200515,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杜云宝,51072719810104231X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈金求,452501198907011281,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈金求,452501198907011281,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘小彬,362427199509055319,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李文军,431126199111062214,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("伍春吉,511529199801015811,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("伍洪安,511529199711255838,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("殷树斌,230303199103304015,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("殷树斌,230303199103304015,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李文军,431126199111062214,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈雄,420222198706173274,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("余燕妮,441602199310062821,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘小彬,362427199509055319,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杜平,341225198804206041,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘建飞,341221197704136293,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘小彬,362427199509055319,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王中如,432322196812306659,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李相凤,653130196202163065,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杜品潘,653130195703273073,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("袁鹏,511321199609124418,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("马国福,62302719820301001X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张凤敏,130929198104040929,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("马国福,62302719820301001X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("姜付洲,41102419601128253X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘玉真,411024196205162544,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("米娥,530324198802150922,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李坤,530325198706201394,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘秋菊,220382198606091647,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘文菊,220382198911221620,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘秋菊,220382198606091647,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘文菊,220382198911221620,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("徐永利,522132198712055939,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈宏,510322199408158617,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("胡克,360124198912067510,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("徐永利,522132198712055939,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李明秀,362124197209232825,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖肇春,36212419710309281X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("沈红玲,412322197602096324,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("马浩轩,232326199303086530,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李响,232326199608186532,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("钟支强,36210219790501361X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("朱学玲,421125196907146163,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("毛求生,421125196503255857,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈千秋,422127196209075832,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈宏,510322199408158617,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("罗湘宁,640382200109014323,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("罗光辉,64212519740321101X,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杜存信,320322195303293130,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王秀兰,320322195711273120,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("朱学玲,421125196907146163,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("毛求生,421125196503255857,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈千秋,422127196209075832,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘志敏,512532197302114022,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("陈光容,512532197001141828,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李明秀,362124197209232825,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖肇春,36212419710309281X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("安玉苍,620521196809267378,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李明秀,362124197209232825,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖肇春,36212419710309281X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄培祝,452330196902140211,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("胡英,512532196507025125,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李家泽,512532196104135119,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王小斌,510922197206100779,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("任德香,510922196906028187,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("周旺生,362329197206036610,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("胡莲英,362329197403026649,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖肇春,36212419710309281X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李明秀,362124197209232825,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘文菊,220382198911221620,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("徐海涛,62222519940513061X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("潘秋菊,220382198606091647,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张讨聪,36232119691205081X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("缪秀荣,362321197010050903,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘卫东,220181198502062414,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("吕彩凤,231181198812102728,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("董应娅,513002199408188163,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王小斌,510922197206100779,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("任德香,510922196906028187,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("吕彩凤,231181198812102728,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("廖湘宁,430321199110045437,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李利新,232101197507071018,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("沈秀英,35082219820106654X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李付强,654301198208160817,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李付强,654301198208160817,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李付强,654301198208160817,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨昌前,522229197612073032,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李利新,232101197507071018,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("雷勇,612429199108275358,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("邹芬,513029198504026581,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("冷发全,510623198209023435,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("由桂萍,230103195511050940,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨大伟,230103194701300934,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄浩钰,522501199410080022,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("韩俊辉,411521199511010014,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("曹砚城,211202199605172839,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("韩甲,13068219830124001x,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("吴小玉,513233199602092224,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李旭怡,522101199501193629,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("钟金萍,350981199511280023,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("任冬玲,610302197512202066,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("林余杨,341182199106235415,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("雷瑜,422325198207231018,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("罗仿超,522423198701231933,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王波,430321198902072754,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张玉凤,350321197007036509,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("法希言,210502199608061531,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘辉,420621198010070678,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("吴金锐,421281199110195718,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李崇会,520121199608231027,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨春柏,430422198909073575,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("董海云,230222197901071329,1,O,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李萍,430405197010120029,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("孙有德,460100195910118010,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("王同峰,371122198812141234,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("秦晴,520201198806286024,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄璜,520102198310174011,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("周映兰,320682199511091745,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨水菊,520202199302016320,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("李林生,360733199007191611,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("龙红梅,440802196903211729,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("武亚琪,340302198906150229,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张振侠,232301195505251826,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("杨晓洪,510321199209295663,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("钟惠,51032119920511022X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张志彬,130423199004051056,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("饶谋澄,51032119930205002X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("罗茂丹,510321199305050025,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("肖江波,429004198310123478,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("黄秋艳,429004198909183004,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("肖时兵,430523198307232518,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("肖时兵,430523198307232518,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张洪兵,510321197301253053,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("范桂英,510321197206172888,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("张小燕,142625198204083987,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("何阳阳,610526199204222824,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("邱猛,370826198912283750,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        executepool("刘丹,362229199108100424,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-07-22", t1, pool);
        //TODO 前200结束
        //        executepool("杨洋洋,61020319911128294X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("张成芳,421126197504108163,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("黎明坤,440102198705194818,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("张唱,211421199707166229,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("丁晓姣,511023198903131629,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("葛瑛,330501197911140015,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("李瑞,410928198908140045,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("彭长春,513027197201206852,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("祝佳程,120103199201093219,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("候淇耀,622424199403130071,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("阳东辰,510202196712154114,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("刘家勤,510212196410152829,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("魏金风,652627195202261523,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("郭海龙,65430119850529351x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("郭文军,652627194503181514,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("韩波,510102195908033162,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("徐静,52010319930528126X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("李俊卿,520103199406016019,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("廖明浩,429004198601201755,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("邹舟,420503198511261861,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("陈绪国,420222198510094451,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("黄晓彬,445281199704193012,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("方书乐,35012519770804141x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("张喜,371502199110199344,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("韦竺君,450331199512122729,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("陈荣伟,350583199005053793,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("陈荣辉,350583198711073711,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("赵鼠才,142202196002132116,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("汪佳,50010819890502552X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("杨丽原,320827198104260021,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("王玉成,371321199011084718,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("张四霞,412727198511287721,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("张伟,431081198509043499,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("唐兰芳,431081198610034204,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("张兴照,130633199508292623,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("胡振国,410108199507270039,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("陈洋,430381199604084627,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("陈煦,43038119970727233x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("乔治航,410329199502013036,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("罗映,510722197806198801,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("石明珠,370181198904044844,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("刘岳枫,445221198412081624,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李茹,410103199007300025,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("宁睿,530381199311092344,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("李利新,232101197507071018,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("王天惠,370205198610110526,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("候东明,652801198706255013,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("李刚,513022199102050394,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("胡雅涵,340803199506142885,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("陈勇,522324199410211233,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("曾瑶,460104199409280026,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("何思佳,510902199408229224,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("江珊,441522198801280626,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("潘卫芳,533421196904120724,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("和建秀,53322119670402004X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("黄纪继,513029199406063957,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("安婕,620102198106163941,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("李培峰,120106197302267054,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("王丽丽,211422198201190426,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("郭东媚,430481199410206409,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("蒋文艺,510123199412160045,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("冀芳丽,130825199601250023,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-30", t1, pool);
        //        executepool("封园,610221199309211322,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-31", t1, pool);
        //        executepool("宋文宫,142228199901123077,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-01", t1, pool);
        //        executepool("田和平,43080219760726161x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-02", t1, pool);
        //        executepool("程倩倩,341126199006126368,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-03", t1, pool);
        //        executepool("丁柳权,45242419891008005x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("林淑贞,441522199009102046,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("陶佩佩,321283199602086445,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("王雷雷,130923199109071034,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-07", t1, pool);
        //        executepool("陆春蓉,510722196508015603,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-08", t1, pool);
        //        executepool("秦珍英,510722196611015580,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-09", t1, pool);
        //        executepool("黄桂英,510722196304225588,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-10", t1, pool);
        //        executepool("李志姣,510182198810043026,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-11", t1, pool);
        //        executepool("王培静,130429198707208420,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-12", t1, pool);
        //        executepool("李卫红,430121198904072220,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-13", t1, pool);
        //        executepool("符志军,430221198802122616,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-14", t1, pool);
        //        executepool("郝炳星,610623196301020135,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-16", t1, pool);
        //        executepool("张振侠,232301195505251826,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("张磊,330225198309140310,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        //        executepool("董茜茜,350426199001062024,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("张兰,522723199008183727,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("陈云迎,35020519861120204X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        //        executepool("屈威,429006198605055137,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        //        executepool("刘云霄,412701198605304015,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("肖结才,340824197712012857,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-25", t1, pool);
        //        executepool("李鑫宇,341221199402150646,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("殷建宇,341221199505200810,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("邢姣姣,610523198802017827,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-28", t1, pool);
        //        executepool("李成城,341221199510108090,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("张晋,532331199509172612,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-30", t1, pool);
        //        executepool("张敏,132902197101015303,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-31", t1, pool);
        //        executepool("左金敏,132902197506035281,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-01", t1, pool);
        //        executepool("贺旭雅,430224199708253621,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-02", t1, pool);
        //        executepool("薛吴皖,430223199610237221,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-03", t1, pool);
        //        executepool("温馨,440803199511133944,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("余惠杰,445122198707017014,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-25", t1, pool);
        //        executepool("胡美华,422201196811241890,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("张洲弟,350622199210180014,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-07", t1, pool);
        //        executepool("刘浩,370481199209226719,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-08", t1, pool);
        //        TODO 100个
        //        executepool("王定舟,513023196707140010,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-09", t1, pool);
        //        executepool("陈麟,35032219820908151x,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-10", t1, pool);
        //        executepool("刘新平,341221198204161374,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-11", t1, pool);
        //        executepool("王强,510132199604304011,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-12", t1, pool);
        //        executepool("许晶晶,610502198711110661,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-13", t1, pool);
        //        executepool("兰巧莉,612101196509100229,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "", t1, pool);
        //        executepool("林涌,37028219800304753X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-15", t1, pool);
        //        executepool("戚建发,371312198909295510,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-16", t1, pool);
        //        executepool("戚建强,371312199801225515,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("钟钰翔,E00725255,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("李振宏,450481199305010010,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("赵鸣,210411198906243823,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("王丽,420400196402101064,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("王远华,429004196410250934,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("史先娥,429004196602220940,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("刘传宏,422201197909025939,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("林婷艳,350181199803011884,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("林凯烽,350181200311071616,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("林浩灵,350181199410102232,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("林佳莉,350181199307141866,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-28", t1, pool);
        //        executepool("付春宇,152224198305100110,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("袁宵,320381198804112426,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-30", t1, pool);
        //        executepool("孙少英,610202199001011616,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-31", t1, pool);
        //        executepool("张旭,14273019950419222x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-01", t1, pool);
        //        executepool("孟祥珍,370125199304263422,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-02", t1, pool);
        //        executepool("史鑫,37011219930301772x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-03", t1, pool);
        //        executepool("杨易,370103199301270522,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("周慧敏,32048219930326441x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("袁梅,130626199312185822,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("谭小娟,510781199108276242,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-07", t1, pool);
        //        executepool("张超,51078119861021355x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-08", t1, pool);
        //        executepool("黄思,36220419920120532x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-09", t1, pool);
        //        executepool("红格,150502197908045722,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-10", t1, pool);
        //        executepool("斯琴高娃,150105198511015121,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-11", t1, pool);
        //        executepool("张振侠,232301195505251826,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-13", t1, pool);
        //        executepool("江连连,511123198709254428,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "", t1, pool);
        //        executepool("黎妮,500224199104204624,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-15", t1, pool);
        //        executepool("龚迅,500224199106230041,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-16", t1, pool);
        //        executepool("柳清文,350521196003115011,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("宋教润,370725199106250017,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-18", t1, pool);
        //        executepool("王洪浩,510822198804213510,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-19", t1, pool);
        //        executepool("沈梦超,330483199601275828,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-20", t1, pool);
        //        executepool("方晴晴,341223199709110529,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-21", t1, pool);
        //        executepool("何家国,510721195910119418,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-22", t1, pool);
        //        executepool("肖凯,330621199606288953,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-23", t1, pool);
        //        executepool("赵燕婷,532525198806280045,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-24", t1, pool);
        //        executepool("尕虎,632521198501101032,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("曹宇航,130621199504130621,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("何武骏,450881198812132052,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("袁作付,422429197103185295,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-28", t1, pool);
        //        executepool("周小军,429005198711135214,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("袁小兵,429005198008155379,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-27", t1, pool);
        //        executepool("许滔滔,429005198312105376,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("陶凤丹,330481198909221845,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("孙骅,330825198710031818,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-23", t1, pool);
        //        executepool("邱璐,330825198806135611,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("陆远珍,522601196809180860,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-25", t1, pool);
        //        executepool("彭文英,360428198809175363,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("丁可新,372926199011034556,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-27", t1, pool);
        //        executepool("黄舰,330382198309250918,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-28", t1, pool);
        //        executepool("金蓉蓉,330382198511301424,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("王毅梦,340603199208040249,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-30", t1, pool);
        //        executepool("费尧,520201198202054011,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-31", t1, pool);
        //        executepool("苏永新,520201198112314035,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-01", t1, pool);
        //        executepool("黄京明,330325195612220112,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-02", t1, pool);
        //        executepool("袁震,659001198810261918,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-03", t1, pool);
        //        executepool("陈露,32032319880824406X,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-29", t1, pool);
        //        executepool("刘源,430423198201130016,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-25", t1, pool);
        //        executepool("吴国洲,42080019680902121X,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-26", t1, pool);
        //        executepool("高国娉,420800196606237627,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-07", t1, pool);
        //        executepool("吴晓艳,420802198907011324,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-08", t1, pool);
        //        executepool("吕辉飞,431102198601134561,1,O,1f,,1", "D6016", "JNK", "济南", "JGK", "济南西", "2015-06-09", t1, pool);
        //        executepool("赵朵朵,610502198801086626,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("张国喜,422425197709192419,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李济珅,360105197704170018,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("邵韵卿,320202199009124528,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("刘礼祥,410526198709215353,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("廖庆虎,512928197003022811,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("张燕,342530198707233513,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-01", t1, pool);
        //        executepool("林旭辉,350181200001161755,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-02", t1, pool);
        //        executepool("林淑琴,350321197809142266,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-03", t1, pool);
        //        executepool("唐士鑫,42058119920217141X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-25", t1, pool);
        //        executepool("陈全心,310107196708245418,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-29", t1, pool);
        //        executepool("赖伍妹,440726196208036063,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-26", t1, pool);
        //        executepool("林莉萍,441702198510280349,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-07", t1, pool);
        //        executepool("江小龙,51022319820221611x,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-08", t1, pool);
        //        executepool("黄霞,511528199108051623,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-09", t1, pool);
        //        executepool("罗欢,511528199112111625,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-10", t1, pool);
        //        executepool("聂征晶,520103198701285612,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-11", t1, pool);
        //        executepool("谢秋庆,340321199008203097,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-13", t1, pool);
        //        executepool("谢晓燕,441781198610143523,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "", t1, pool);
        //        executepool("李锡伟,513124197110050019,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-15", t1, pool);
        //        executepool("罗斌,51312419741117017X,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-16", t1, pool);
        //        executepool("邵倩,320281199104044521,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-27", t1, pool);
        //        executepool("胡锦枝,320204199411233522,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-18", t1, pool);
        //        executepool("白永刚,411282198107122331,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-19", t1, pool);
        //        executepool("费礼林,520201198704174048,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-20", t1, pool);
        //        executepool("李冬梅,222401198804020443,1,1,1f,,1", "6336", "CCT", "长春", "CET", "长春南", "2015-06-21", t1, pool);
        //        executepool("王胜,372323199410112134,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("余娇炫,520203199301051411,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        //        //TODO 80个
        //
        //        executepool(
        //                "刘思雨,130103199503231527,1,3,54f,,1|刘思雨,130103199503231527,1,3,27f,,2|殷树斌,230303199103304015,1,3,54f,,1",
        //                "K7092", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("阙安然,350822199502106546,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("冯晓芳,152725198906250329,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("叶德钏,330325196111101419,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("郑爱英,33032519640830142x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("赵小燕,42112719890320046X,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("娄燕燕,370911199410065249,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("黄海芹,460034198204230023,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("叶玲玲,110106198302270344,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("武鹏,140429199202125634,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("陆汉民,362233199509073011,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("文晓明,433023198004083418,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //
        //        executepool("谭睿骁,532621199207224636,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("胡爱玲,230203197404060822,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("王庆娟,370402197301046126,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("向开会,42282219680426102x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("廖晓艳,422822199407041027,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("陈顺坤,44062319710313269x,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("刘岳枫,445221198412081624,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("刘胜芳,340827199012053226,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("李丽芳,340827199012181842,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("曾庆凌,452123199006291352,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //
        //        executepool("张永太,410102196006282515,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("罗狄,360421199304220413,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-26", t1, pool);
        //        executepool("宋宝建,610424198312034617,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("赵涛,411303197201250511,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("全雷,610121198506026118,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-29", t1, pool);
        //        executepool("董元斌,610121197010016456,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("范迪萍,430623196805138205,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-23", t1, pool);
        //        executepool("张武,430426198210056195,1,1,1f,,1", "6233", "HBB", "哈尔滨", "VBB", "哈尔滨东", "2015-06-27", t1, pool);
        //        executepool("姜土胜,510722197402218570,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("沈爱玉,342521196407073444,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //
        //        executepool("杨梅凤,342501198901133426,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("肖爱红,441624198102232922,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("辅洪俊,320911198710020911,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("刘天博,652901199010130415,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("张轩,140107199004212628,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("张玉麒,140109199008220011,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("孙军,620104199002181579,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("朱学亮,530423198712040374,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李华,622326199208033740,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("张占鸿,622323199005053814,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //
        //        executepool("唐雪萍,510921199104102223,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("许双印,410225198811144616,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李秀梅,452424198607251741,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("宋雪梅,510722198308180021,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("张家超,51102119651229375x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("田开金,51102119690324375x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("刘勇,34292319760513661X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("李都,61050219890621003X,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("王宣月,610502199402271220,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("宋宁,21122319870425022x,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //
        //        executepool("杨昊霖,430404198111231519,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-23", t1, pool);
        //        executepool("宋国清,211223196001080034,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("朱伟,211223196205210021,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("杨立,500223199506040021,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("杨春燕,510227197204280044,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        //        executepool("刘明均,510227197512240028,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-28", t1, pool);
        //        executepool("刘乐乐,610525199603041928,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("王锰,510802199011192616,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-30", t1, pool);
        //        executepool("洪花,422324198212251228,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-31", t1, pool);
        //        executepool("李璟轩,120103199401194516,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-01", t1, pool);
        //
        //        executepool("胡自立,420684198912010135,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-02", t1, pool);
        //        executepool("彭旺,432322198001077011,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-03", t1, pool);
        //        executepool("杨培洪,510321198211245556,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-29", t1, pool);
        //        executepool("杜员,421222199512200022,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-25", t1, pool);
        //        executepool("胡龙,532325198103120319,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-26", t1, pool);
        //        executepool("赵小庆,411502199610015620,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-07", t1, pool);
        //        executepool("郭光耀,410724199511130031,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-08", t1, pool);
        //        executepool("张晓元,152624196902080034,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-09", t1, pool);
        //        executepool("易维娜,500225198704083426,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-10", t1, pool);
        //        executepool("胡庆,130206198606011818,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-11", t1, pool);
        //
        //        executepool("王淦英,370302198706112119,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-12", t1, pool);
        //        executepool("赵林水,370302198006277537,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-13", t1, pool);
        //        executepool("徐涛,420921199607075050,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "", t1, pool);
        //        executepool("叶顺航,441623198102262439,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-15", t1, pool);
        //        executepool("黄民强,440923199209116853,1,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-16", t1, pool);
        //        executepool("高蔚明,310107198702253037,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("丁佳田,43028119780310661X,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("张艳平,342201199405103250,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        //        executepool("李宏展,440306199708220218,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        //        executepool("田建江,522526199605280013,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-25", t1, pool);
        //
        //        //5个
        //        executepool("苏奥南,210381198809175922,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        //        executepool("吴蓉,430404198506051520,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-27", t1, pool);
        //        executepool("李运鸿,430523198412110096,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-28", t1, pool);
        //        executepool("袁野,342201199101070832,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);
        //        executepool("任超董,330227199204104257,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-30", t1, pool);
        //        //10
        executepool("陈琦,330327199403098801,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-31", t1, pool);
        executepool("徐璞,330381199409276216,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-21", t1, pool);
        executepool("张珂民,422422195710226518,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-22", t1, pool);
        executepool("赵如意,411528199311100431,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        executepool("邱雪俊,500228199007126551,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-29", t1, pool);

        executepool("莫云恋,460002198903053627,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-25", t1, pool);
        executepool("林东丽,440681199611206029,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-26", t1, pool);
        executepool("贾春阳,230503198003310617,1,1f,,1", "6805", "TYV", "太原", "TBV", "太原北", "2015-06-27", t1, pool);
        executepool("赵玥霓,522101199608197646,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        executepool("刚存洋,41132219971205422x,1,O,1f,,1", "G560", "ZZF", "郑州", "ZAF", "郑州东", "2015-06-23", t1, pool);
        // 关闭线程池
        pool.shutdown();
    }

    public void tongchengpiliangtuipiao() {

    }

    private void executepool(String passengerstring, String checi, String from_station_code, String from_station_name,
            String to_station_code, String to_station_name, String train_date, Thread t1, ExecutorService pool) {
        Long l1 = System.currentTimeMillis();
        String reqtoken = "fiendcalbackreqtoken" + (int) (Math.random() * 100);
        String orderid = "TC_20150127_fiendyibutest_" + l1 + "_" + new Random().nextInt(100) + "_"
                + new Random().nextInt(100) + "_" + new Random().nextInt(100) + "_" + new Random().nextInt(100);
        List<Trainpassenger> passengers = new ArrayList<Trainpassenger>();
        String[] passs = passengerstring.split("[|]");
        for (int i = 0; i < passs.length; i++) {
            String passengerstringss = passs[i];
            String[] passengerstringssss = passengerstringss.split(",");
            passengers.add(getTrainpassenger(passengerstringssss[0], passengerstringssss[1],
                    Integer.parseInt(passengerstringssss[2]), passengerstringssss[3],
                    Float.parseFloat(passengerstringssss[4]), passengerstringssss[5],
                    Integer.parseInt(passengerstringssss[6])));
        }
        new CreateTongchengTrainOrderYiBuThread(partnerid, key, trainorderurl, orderid, checi, from_station_code,
                from_station_name, to_station_code, to_station_name, train_date, passengers, this.callbackurl, reqtoken)
                .run();
        //        pool.execute(t1);

    }

    public void tongchengpiliangzhifu(String[] orderidarray) {
        for (int i = 0; i < orderidarray.length; i++) {
            train_confirm(orderidarray[i], "zf" + System.currentTimeMillis());
        }
    }

    /**
     * 
     * @param passengers
     * @param checi
     * @param from_station_code
     * @param from_station_name
     * @param to_station_code
     * @param to_station_name
     * @param train_date
     * @return
     * @time 2014年12月27日 下午8:02:52
     * @author chendong
     */
    public Trainorder getTrainorder(List<Trainpassenger> passengers, String checi, String from_station_code,
            String from_station_name, String to_station_code, String to_station_name, String train_date) {
        Trainorder trainorder = new Trainorder();
        //        List<Trainpassenger> passengers = new ArrayList<Trainpassenger>();
        //        passengers.add(test.getTrainpassenger("陈新福", "362322198210167517", 1, "1", 1f, "", 1));
        //        passengers.add(test.getTrainpassenger("王战朝", "410883199006281010", 1, "1", 1f, "EC509466651010012", 1));

        String orderid = "TC_20141227_" + getcurrentTimeMillis();
        trainorder.setQunarOrdernumber(orderid);
        Trainticket trainticket = new Trainticket();
        //        String checi = "6801";
        trainticket.setTrainno(checi);

        //        String from_station_code = "TYV";
        trainticket.setDeparture(from_station_code);
        //        String from_station_name = "太原";
        //        String to_station_code = "TBV";
        trainticket.setArrival(to_station_code);
        //        String to_station_name = "太原北";
        //        String train_date = "2015-06-01";
        trainticket.setDeparttime(train_date);
        passengers.get(0).setTrainticket(trainticket);
        trainorder.setPassengers(passengers);
        return trainorder;
    }

    /**
     * 
     * 姓名,证件号,证件类型,座位编码,价格,乘客类型
     * @param name 姓名
     * @param idnumber 证件号
     * @param idtype 证件类型 1:"二代身份证"; 3:"护照";4:"港澳通行证";5: "台湾通行证";
     * @param seattype 座位编码。与座位名称对应关系：9:商务座，P:特等座，M:一等座，O:二等座，6:高级软卧，
     *                  4:软卧，3:硬卧，2:软座，1:硬座 注意：当最低的一种座位，无票时，购买选择该座位种类， 
     *                  买下的就是无座(也就说买无座的席别编码就是该车次的 最低席别的编码)，另外，当最低席别的票卖完了的时候 才可以卖无座的票。
     * @param price 价格
     * @param ticketno 票号
     * @param tickettype 乘客类型 1:成人票，2:儿童票，3:学生票，4:残军票
     * @return
     * @time 2014年12月27日 上午11:30:35
     * @author chendong
     */
    private Trainpassenger getTrainpassenger(String name, String idnumber, int idtype, String seattype, Float price,
            String ticketno, int tickettype) {
        Trainpassenger Trainpassenger = new Trainpassenger();
        Trainpassenger.setName(name);
        Trainpassenger.setIdnumber(idnumber);
        Trainpassenger.setIdtype(idtype);// 1:"二代身份证"; 3:"护照";4:"港澳通行证";5: "台湾通行证";
        List<Trainticket> traintickets = new ArrayList<Trainticket>();
        Trainticket e = new Trainticket();
        e.setSeattype(seattype);
        e.setPrice(price);
        e.setTicketno(ticketno);
        e.setTickettype(tickettype);
        traintickets.add(e);
        Trainpassenger.setTraintickets(traintickets);
        return Trainpassenger;

    }

    /**
     * 4.1. 查询账户余额
     * 
     * 
     * @time 2014年12月26日10:28:45
     * @author chendong
     */
    private String query_money() {
        String method = "query_money";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        //        String passengerJSON = "{\"passengerid\":\"1\",\"ticket_no\":\"\",\"passengersename\":\"陈栋\",\"passportseno\":\"412823198909298017\",\"passporttypeseid\":\"1\",\"passporttypeseidname\":\"二代身份证\",\"piaotype\":\"1\",\"piaotypename\":\"\",\"zwcode\":\"3\",\"zwname\":\"硬卧\",\"cxin\":\"\",\"price\":\"488.5\"},{\"passengerid\":\"1\",\"ticket_no\":\"\",\"passengersename\":\"王战朝\",\"passportseno\":\"410883199006281010\",\"passporttypeseid\":\"1\",\"passporttypeseidname\":\"二代身份证\",\"piaotype\":\"1\",\"piaotypename\":\"\",\"zwcode\":\"3\",\"zwname\":\"硬卧\",\"cxin\":\"\",\"price\":\"488.5\"}";
        String passengerJSON = "";
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\"}";
        System.out.println(jsonStr);
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.5. 申请分配座位席别
     * 
     * 
     * @param orderid
     * @param checi T124
     * @param from_station_code CSQ
     * @param from_station_name 长沙
     * @param to_station_code CCT
     * @param to_station_name 长春
     * @param train_date 2014-12-18
     * @param passengers 乘客
     * @time 2014年12月12日 下午2:59:15
     * @author chendong
     */
    private String train_order(String orderid, String checi, String from_station_code, String from_station_name,
            String to_station_code, String to_station_name, String train_date, List<Trainpassenger> passengers) {
        String method = "train_order";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        //        String passengerJSON = "{\"passengerid\":\"1\",\"ticket_no\":\"\",\"passengersename\":\"陈栋\",\"passportseno\":\"412823198909298017\",\"passporttypeseid\":\"1\",\"passporttypeseidname\":\"二代身份证\",\"piaotype\":\"1\",\"piaotypename\":\"\",\"zwcode\":\"3\",\"zwname\":\"硬卧\",\"cxin\":\"\",\"price\":\"488.5\"},{\"passengerid\":\"1\",\"ticket_no\":\"\",\"passengersename\":\"王战朝\",\"passportseno\":\"410883199006281010\",\"passporttypeseid\":\"1\",\"passporttypeseidname\":\"二代身份证\",\"piaotype\":\"1\",\"piaotypename\":\"\",\"zwcode\":\"3\",\"zwname\":\"硬卧\",\"cxin\":\"\",\"price\":\"488.5\"}";
        String passengerJSON = "";
        for (int i = 0; i < passengers.size(); i++) {
            Trainpassenger trainpassenger = passengers.get(i);
            Trainticket trainticket = passengers.get(i).getTraintickets().get(0);
            String passporttypeseid = "1";
            String passporttypeseidname = "二代身份证";

            String zwcode = trainticket.getSeattype();
            String zwname = getzwcode(zwcode);
            Float price = trainticket.getPrice();
            int piaotype = trainticket.getTickettype();
            String piaotypename = trainticket.getTickettypestr();
            passengerJSON += "{\"passengerid\":\"" + i + "\",\"ticket_no\":\"\",\"passengersename\":\""
                    + trainpassenger.getName() + "\",\"passportseno\":\"" + trainpassenger.getIdnumber()
                    + "\",\"passporttypeseid\":\"" + passporttypeseid + "\",\"passporttypeseidname\":\""
                    + passporttypeseidname + "\",\"piaotype\":\"" + piaotype + "\",\"piaotypename\":\"" + piaotypename
                    + "\",\"zwcode\":\"" + zwcode + "\",\"zwname\":\"" + zwname + "\",\"cxin\":\"\",\"price\":\""
                    + price + "\"}";
            if (i < passengers.size() - 1) {
                passengerJSON += ",";
            }
        }
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"checi\":\"" + checi
                + "\",\"from_station_code\":\"" + from_station_code + "\",\"from_station_name\":\"" + from_station_name
                + "\",\"to_station_code\":\"" + to_station_code + "\",\"to_station_name\":\"" + to_station_name
                + "\",\"train_date\":\"" + train_date + "\",\"passengers\":[" + passengerJSON + "]}";
        System.out.println(jsonStr);
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.6. 火车票确认出票
     * 
     * @param orderid
     * @param transactionid
     * @return
     * @time 2014年12月12日 下午3:38:59
     * @author chendong
     */
    private String train_confirm(String orderid, String transactionid) {
        String method = "train_confirm";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        System.out.println("jsonStr=" + jsonStr);
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        System.out.println("resultString=" + resultString);
        return resultString;
    }

    /**
     * 4.7. 取消火车票订单
     * 
     * @param orderid
     * @param transactionid
     * @return
     * @time 2014年12月12日 下午3:42:08
     * @author chendong
     */
    private String train_cancel(String orderid, String transactionid) {
        String method = "train_cancel";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        System.out.println(jsonStr);
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        System.out.println(resultString);
        return resultString;
    }

    /**
     * 4.8. 查询订单状态
     * 
     * @param orderid
     * @return
     * @time 2014年12月12日 下午3:44:57
     * @author chendong
     */
    private String train_query_status(String orderid) {
        String method = "train_query_status";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\"}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.9. 查询订单详情
     * 
     * @param orderid
     * @param transactionid
     * @return
     * @time 2014年12月12日 下午3:45:30
     * @author chendong
     */
    private String train_query_info(String orderid, String transactionid) {
        String method = "train_query_info";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.10. 在线退票
     * 
     * @param orderid
     * @param transactionid
     * @param ordernumber
     * @param reqtoken
     * @param callbackurl
     * @param trainorder
     * @return
     * @time 2014年12月12日 下午3:48:55
     * @author chendong
     */
    private String return_ticket(String orderid, String transactionid, String ordernumber, String reqtoken,
            String callbackurl, Trainorder trainorder) {
        String method = "return_ticket";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String passengerJSON = "";
        for (int i = 0; i < trainorder.getPassengers().size(); i++) {
            Trainpassenger trainpassenger = trainorder.getPassengers().get(i);

            passengerJSON += "{\"ticket_no\":\"" + trainpassenger.getTraintickets().get(0).getTicketno()
                    + "\",\"passengername\":\"" + trainpassenger.getName() + "\",\"passportseno\":\""
                    + trainpassenger.getIdnumber() + "\",\"passporttypeseid\":\"1\"}";
            if (i < trainorder.getPassengers().size() - 1) {
                passengerJSON += ",";
            }
        }
        String jsonStr = "{\"partnerid\":\"" + partnerid + "\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\",\"ordernumber\":\"" + ordernumber + "\",\"reqtoken\":\"" + reqtoken + "\",\"callbackurl\":\""
                + callbackurl + "\",,\"tickets\":[" + passengerJSON + "]}";
        System.out.println("jsonStr=" + jsonStr);
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "utf-8").toString();
        return resultString;
    }

    /**
     * 4.12.请求改签
     * time 2014年12月12日 下午2:46:18
     * @author 路平
     */
    private String train_request_change(String orderid, String transactionid, String ordernumber, String change_checi,
            String change_datetime, String change_zwcode, String old_zwcode, String passengersename,
            String passporttypeseid, String passportseno, String piaotype, String old_ticket_no) {
        String method = "train_request_change";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"tongcheng_train\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\",\"ordernumber\":\"" + ordernumber + "\",\"change_checi\":\"" + change_checi
                + "\",\"change_datetime\":\"" + change_datetime + "\",\"change_zwcode\":\"" + change_zwcode
                + "\",\"old_zwcode\":\"" + old_zwcode + "\",\"ticketinfo\":[{\"passengersename\":\"" + passengersename
                + "\",\"passporttypeseid\":\"" + passporttypeseid + "\",\"passportseno\":\"" + passportseno
                + "\",\"piaotype\": \"" + piaotype + "\",\"old_ticket_no\":\"" + old_ticket_no + "\"}]}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.13.取消改签
     * time 2014年12月12日 下午2:46:18
     * @author 路平
     */
    private String train_cancel_change(String orderid, String transactionid) {
        String method = "train_cancel_change";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"tongcheng_train\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.13.确认改签
     * time 2014年12月12日 下午2:46:18
     * @author 路平
     */
    private String train_confirm_change(String orderid, String transactionid) {
        String method = "train_confirm_change";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"tongcheng_train\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.16.确认出票回调通知
     * time 2014年12月12日 下午2:46:18
     * @author 路平
     */
    private String train_pay_callback(String orderid, String transactionid) {
        String method = "train_pay_callback";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"tongcheng_train\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\"}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * 4.10.4.退票回调通知
     * time 2014年12月12日 下午2:46:18
     * @author 路平
     */
    private String train_refun_callback(String orderid, String transactionid, String returntype, String reqtoken,
            String passengerid, String ticket_no, String passengersename, String passportseno, String passporttypeseid,
            String returnsuccess, String returnmoney, String returntime, String returnfailid, String returnfailmsg) {
        String method = "train_refun_callback";
        String reqtime = getreqtime();
        String sign = getsign(partnerid, method, reqtime, key);
        String jsonStr = "{\"partnerid\":\"tongcheng_train\",\"method\":\"" + method + "\",\"reqtime\":\"" + reqtime
                + "\",\"sign\":\"" + sign + "\",\"orderid\":\"" + orderid + "\",\"transactionid\":\"" + transactionid
                + "\",\"returntype\":\"" + returntype + "\",\"reqtoken\":\"" + reqtoken
                + "\",\"returntickets\":[{\"passengerid\":\"" + passengerid + "\",\"ticket_no\":\"" + ticket_no
                + "\",\"passengersename\":\"" + passengersename + "\",\"passportseno\":\"" + passportseno
                + "\",\"passporttypeseid\":\"" + passporttypeseid + "\",\"returnsuccess\":\"" + returnsuccess
                + "\",\"returnmoney\":\"" + returnmoney + "\",\"returntime\":\"" + returntime
                + "\",\"returnfailid\":\"" + returnfailid + "\",\"returnfailmsg\":\"" + returnfailmsg + "\"}]}";
        String resultString = SendPostandGet.submitPost(trainorderurl, "jsonStr=" + jsonStr, "UTF-8").toString();
        return resultString;
    }

    /**
     * md5(partnerid+method+reqtime+md5(key))，
     * 
     * @time 2014年12月12日 下午2:44:31
     * @author chendong
     */
    public static String getsign(String partnerid, String method, String reqtime, String key) {
        return MD5Util.MD5Encode(partnerid + method + reqtime + MD5Util.MD5Encode(key, "UTF-8"), "UTF-8");
    }

    public static String getreqtime() {
        return yyyyMMddHHmmssSSS.format(new Date());
    }

    public static String getcurrentTimeMillis() {
        return System.currentTimeMillis() + "";
    }

    private void executepool(Thread t1, ExecutorService pool) {
        Long l1 = System.currentTimeMillis();
        String orderid = "TC_20150102_cdtest:" + l1 + ":" + new Random().nextInt(1000000);
        t1 = new TestThread(orderid);
        pool.execute(t1);
    }

}
